html/0-163-notes/SQLServer/f-misc.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-12-27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>练习题</title>
<meta name="generator" content="Org mode">
<meta name="author" content="悟饭">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliuyao/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">练习题</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc8f379a">1. emp/dept 测试数据</a></li>
<li><a href="#org87ea235">2. SQL 自测</a>
<ul>
<li><a href="#org48fa4ab">2.1. 查询每个部门下有多少员工</a></li>
<li><a href="#org94d8b64">2.2. 查询除去 salesman 所有平均工资超过 1500 的部门</a></li>
<li><a href="#orgdade464">2.3. 查询在 new york 工作的所有员工的姓名，部门名称和工资信息</a></li>
<li><a href="#orgbb75295">2.4. 查询姓名为 King 的员工的编号，名称跟部门</a></li>
<li><a href="#orgaa89afa">2.5. 查询各种工作的最低工资</a></li>
<li><a href="#orga35c2ef">2.6. 查询工龄大于 10 年的所有员工信息</a></li>
<li><a href="#org1b9a30b">2.7. 查询每个部门员工数量，平均工资和平均工作年限</a></li>
<li><a href="#org419833e">2.8. 统计各部门每个工种的人数，平均工资</a></li>
<li><a href="#org5963880">2.9. 查询从事同一种工作但不属于同一部门的员工信息</a></li>
<li><a href="#org73295a2">2.10. 查询所有员工工资都大于 1000 的部门的信息及员工信息</a></li>
<li><a href="#orgf601043">2.11. 其他题目</a></li>
</ul>
</li>
<li><a href="#org9f63fb1">3. Lagou.com 测试数据</a></li>
<li><a href="#orge53d53b">4. 奇 vs 偶</a>
<ul>
<li><a href="#orgdea7b96">4.1. 1/3/5/7 出的题</a></li>
<li><a href="#org762c587">4.2. 2/4/6/8 出的题</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<section id="outline-container-orgc8f379a" class="outline-2">
<h2 id="orgc8f379a"><span class="section-number-2">1.</span> emp/dept 测试数据</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a020f0;">CREATE</span> DATABASE oa;
use oa;

<span style="color: #a020f0;">CREATE</span> <span style="color: #a020f0;">TABLE</span> <span style="color: #0000ff;">dept</span> <span style="color: #707183;">(</span> <span style="color: #b22222;">-- department</span>
  deptno <span style="color: #228b22;">int</span>,
  dname  <span style="color: #228b22;">VARCHAR</span><span style="color: #7388d6;">(</span>14<span style="color: #7388d6;">)</span>,
  loc    <span style="color: #228b22;">VARCHAR</span><span style="color: #7388d6;">(</span>13<span style="color: #7388d6;">)</span>, <span style="color: #b22222;">-- location/address</span>
  <span style="color: #a020f0;">CONSTRAINT</span> pk_dept <span style="color: #a020f0;">PRIMARY</span> <span style="color: #a020f0;">KEY</span> <span style="color: #7388d6;">(</span>deptno<span style="color: #7388d6;">)</span>
<span style="color: #707183;">)</span>;

<span style="color: #a020f0;">CREATE</span> <span style="color: #a020f0;">TABLE</span> <span style="color: #0000ff;">emp</span> <span style="color: #707183;">(</span> <span style="color: #b22222;">-- employee</span>
  empno    <span style="color: #228b22;">int</span>,
  ename    <span style="color: #228b22;">VARCHAR</span><span style="color: #7388d6;">(</span>10<span style="color: #7388d6;">)</span>,
  job      <span style="color: #228b22;">VARCHAR</span><span style="color: #7388d6;">(</span>9<span style="color: #7388d6;">)</span>,
  mgr      <span style="color: #228b22;">int</span>,
  hiredate <span style="color: #228b22;">DATE</span>,
  sal      <span style="color: #228b22;">float</span>,
  comm     <span style="color: #228b22;">float</span>,
  deptno   <span style="color: #228b22;">int</span>,
  <span style="color: #a020f0;">CONSTRAINT</span> pk_emp <span style="color: #a020f0;">PRIMARY</span> <span style="color: #a020f0;">KEY</span> <span style="color: #7388d6;">(</span>empno<span style="color: #7388d6;">)</span>,
  <span style="color: #a020f0;">CONSTRAINT</span> fk_deptno <span style="color: #a020f0;">FOREIGN</span> <span style="color: #a020f0;">KEY</span> <span style="color: #7388d6;">(</span>deptno<span style="color: #7388d6;">)</span> <span style="color: #a020f0;">REFERENCES</span> dept <span style="color: #7388d6;">(</span>deptno<span style="color: #7388d6;">)</span>
<span style="color: #707183;">)</span>;

<span style="color: #a020f0;">CREATE</span> <span style="color: #a020f0;">TABLE</span> <span style="color: #0000ff;">bonus</span> <span style="color: #707183;">(</span> <span style="color: #b22222;">-- bonus</span>
  ename <span style="color: #228b22;">VARCHAR</span><span style="color: #7388d6;">(</span>10<span style="color: #7388d6;">)</span>,
  job   <span style="color: #228b22;">VARCHAR</span><span style="color: #7388d6;">(</span>9<span style="color: #7388d6;">)</span>,
  sal   <span style="color: #228b22;">float</span>,
  comm  <span style="color: #228b22;">float</span>
<span style="color: #707183;">)</span>;

<span style="color: #a020f0;">CREATE</span> <span style="color: #a020f0;">TABLE</span> <span style="color: #0000ff;">salgrade</span> <span style="color: #707183;">(</span> <span style="color: #b22222;">-- salary grade</span>
  grade <span style="color: #228b22;">int</span>,
  losal <span style="color: #228b22;">float</span>,
  hisal <span style="color: #228b22;">float</span>
<span style="color: #707183;">)</span>;

<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> dept <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span>10, <span style="color: #8b2252;">'ACCOUNTING'</span>, <span style="color: #8b2252;">'NEW YORK'</span><span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> dept <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span>20, <span style="color: #8b2252;">'RESEARCH'</span>, <span style="color: #8b2252;">'DALLAS'</span><span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> dept <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span>30, <span style="color: #8b2252;">'SALES'</span>, <span style="color: #8b2252;">'CHICAGO'</span><span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> dept <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span>40, <span style="color: #8b2252;">'OPERATIONS'</span>, <span style="color: #8b2252;">'BOSTON'</span><span style="color: #707183;">)</span>;

<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7839, <span style="color: #8b2252;">'KING'</span>, <span style="color: #8b2252;">'PRESIDENT'</span>, <span style="color: #a020f0;">null</span>, <span style="color: #8b2252;">'1981-11-17'</span>, 5000, <span style="color: #a020f0;">null</span>, 10 <span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7698, <span style="color: #8b2252;">'BLAKE'</span>, <span style="color: #8b2252;">'MANAGER'</span>, 7839, <span style="color: #8b2252;">'1981-05-01'</span>, 2850, <span style="color: #a020f0;">null</span>, 30<span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7782, <span style="color: #8b2252;">'CLARK'</span>, <span style="color: #8b2252;">'MANAGER'</span>, 7839, <span style="color: #8b2252;">'1981-06-09'</span>, 2450, <span style="color: #a020f0;">null</span>, 10<span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7566, <span style="color: #8b2252;">'JONES'</span>, <span style="color: #8b2252;">'MANAGER'</span>, 7839, <span style="color: #8b2252;">'1981-04-02'</span>, 2975, <span style="color: #a020f0;">null</span>, 20<span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7788, <span style="color: #8b2252;">'SCOTT'</span>, <span style="color: #8b2252;">'ANALYST'</span>, 7566, <span style="color: #8b2252;">'1987-07-13'</span>, 3000, <span style="color: #a020f0;">null</span>, 20<span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7902, <span style="color: #8b2252;">'FORD'</span>, <span style="color: #8b2252;">'ANALYST'</span>, 7566, <span style="color: #8b2252;">'1981-12-03'</span>, 3000, <span style="color: #a020f0;">null</span>, 20 <span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7369, <span style="color: #8b2252;">'SMITH'</span>, <span style="color: #8b2252;">'CLERK'</span>, 7902, <span style="color: #8b2252;">'1980-12-17'</span>, 800, <span style="color: #a020f0;">null</span>, 20 <span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7499, <span style="color: #8b2252;">'ALLEN'</span>, <span style="color: #8b2252;">'SALESMAN'</span>, 7698, <span style="color: #8b2252;">'1981-02-20'</span>, 1600, 300, 30<span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7521, <span style="color: #8b2252;">'WARD'</span>, <span style="color: #8b2252;">'SALESMAN'</span>, 7698, <span style="color: #8b2252;">'1981-02-22'</span>, 1250, 500, 30 <span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7654, <span style="color: #8b2252;">'MARTIN'</span>, <span style="color: #8b2252;">'SALESMAN'</span>, 7698, <span style="color: #8b2252;">'1981-09-28'</span>, 1250, 1400, 30 <span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7844, <span style="color: #8b2252;">'TURNER'</span>, <span style="color: #8b2252;">'SALESMAN'</span>, 7698, <span style="color: #8b2252;">'1981-09-08'</span>, 1500, 0, 30<span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7876, <span style="color: #8b2252;">'ADAMS'</span>, <span style="color: #8b2252;">'CLERK'</span>, 7788, <span style="color: #8b2252;">'1987-07-13'</span>, 1100, <span style="color: #a020f0;">null</span>, 20 <span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7900, <span style="color: #8b2252;">'JAMES'</span>, <span style="color: #8b2252;">'CLERK'</span>, 7698, <span style="color: #8b2252;">'1981-12-03'</span>, 950, <span style="color: #a020f0;">null</span>, 30 <span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> emp <span style="color: #a020f0;">VALUES</span><span style="color: #707183;">(</span> 7934, <span style="color: #8b2252;">'MILLER'</span>, <span style="color: #8b2252;">'CLERK'</span>, 7782, <span style="color: #8b2252;">'1982-01-23'</span>, 1300, <span style="color: #a020f0;">null</span>, 10 <span style="color: #707183;">)</span>;

<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> salgrade <span style="color: #a020f0;">VALUES</span> <span style="color: #707183;">(</span>1, 700, 1200<span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> salgrade <span style="color: #a020f0;">VALUES</span> <span style="color: #707183;">(</span>2, 1201, 1400<span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> salgrade <span style="color: #a020f0;">VALUES</span> <span style="color: #707183;">(</span>3, 1401, 2000<span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> salgrade <span style="color: #a020f0;">VALUES</span> <span style="color: #707183;">(</span>4, 2001, 3000<span style="color: #707183;">)</span>;
<span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> salgrade <span style="color: #a020f0;">VALUES</span> <span style="color: #707183;">(</span>5, 3001, 9999<span style="color: #707183;">)</span>;

<span style="color: #a020f0;">go</span>
</pre>
</div>
</div>
</section>
