.src/旧笔记(163)/SQLServer/f-misc.org
** 查询每个部门下有多少员工

 #+begin_src sql
   select deptno, count(*) from emp  group by deptno;

   -- 第一种，结合上一句，将部门名称加进来
   select s.deptno, d.dname, s.cnt
     from (select deptno, count(*) as cnt from emp  group by deptno) as s
     join dept as d on s.deptno = d.deptno;

   -- 第二种，先将所有要分组的数据搞出来，再进行其他操作
   select d.dname, COUNT(*) from emp as e
     join dept as d on e.deptno = d.deptno
     group by d.dname;
 #+end_src

** 查询除去 salesman 所有平均工资超过 1500 的部门

#+begin_src sql
  select deptno, AVG(sal) from emp
    where job <> 'salesman'
    group by deptno
    having AVG(sal) > 1500;

  select d.dname, AVG(sal) from emp as e
    join dept as d on e.deptno = d.deptno
    where job <> 'salesman'
    group by d.dname
    having AVG(sal) > 1500;
#+end_src

** 查询在 new york 工作的所有员工的姓名，部门名称和工资信息

#+begin_src sql
  select dname, ename, sal from emp
    join dept on emp.deptno = dept.deptno
    where loc =  'new york';
#+end_src
    
** 查询姓名为 King 的员工的编号，名称跟部门

#+begin_src sql
  select empno,ename,dept.dname from emp
    join dept on dept.deptno = emp.deptno
     where ename = 'King';
#+end_src

** 查询各种工作的最低工资

#+begin_src sql
  select job,min(sal) as small from emp group by job;
#+end_src

** 查询工龄大于 10 年的所有员工信息

#+begin_src sql
  select * from emp 
    where datediff(YEAR, hiredate, GETDATE()) > 10
#+end_src

** 查询每个部门员工数量，平均工资和平均工作年限

#+begin_src sql
  select
      dept.dname,
      COUNT(*) as person,
      AVG(sal) as a,
      AVG(DATEDIFF(YEAR, hiredate, GETDATE())) as worktime 
    from emp join dept on emp.deptno = dept.deptno 
    group by dept.dname;
#+end_src

** 统计各部门每个工种的人数，平均工资

#+begin_src sql
  select deptno,
         job,
         count(empno) as allpeople,
         avg(sal) as gongzi
     from emp
     group by job, deptno;
#+end_src

** 查询从事同一种工作但不属于同一部门的员工信息

#+begin_src sql
  select a.ename, a.empno, b.empno, b.ename
    from emp a 
    join emp b on a.job=b.job 
    where a.deptno <> b.deptno
      and a.empno > b.empno;
#+end_src

| ename  | empno |    empno | ename |
|--------+-------+----------+-------|
| SMITH  |  7369 | <   7900 | JAMES |
| JAMES  |  7900 | >   7369 | SMITH |
| MILLER |  7934 |     7369 | SMITH |
| BLAKE  |  7698 |     7566 | JONES |
| CLARK  |  7782 |     7566 | JONES |
| CLARK  |  7782 |     7698 | BLAKE |
| JAMES  |  7900 |     7876 | ADAMS |
| MILLER |  7934 |     7876 | ADAMS |
| MILLER |  7934 |     7900 | JAMES |

** 查询所有员工工资都大于 1000 的部门的信息及员工信息

#+begin_src sql
  select * from emp e
    join dept d on e.deptno = d.deptno
    join (select deptno from emp
            group by deptno
            having min(sal + ISNULL(comm,0)) > 1000) c on e.deptno = c.deptno;

  select * from dept a  join emp b
    on a.deptno = b.deptno
    where a.deptno not in(select deptno from emp where sal < 1000);
#+end_src

