html/0-163-notes/SQLServer/f-misc.html

<section id="outline-container-org87ea235" class="outline-2">
<h2 id="org87ea235"><span class="section-number-2">2.</span> SQL 自测</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org48fa4ab" class="outline-3">
<h3 id="org48fa4ab"><span class="section-number-3">2.1.</span> 查询每个部门下有多少员工</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a020f0;">select</span> deptno, <span style="color: #483d8b;">count</span><span style="color: #707183;">(</span>*<span style="color: #707183;">)</span> <span style="color: #a020f0;">from</span> emp  <span style="color: #a020f0;">group</span> <span style="color: #a020f0;">by</span> deptno;

<span style="color: #b22222;">-- &#31532;&#19968;&#31181;&#65292;&#32467;&#21512;&#19978;&#19968;&#21477;&#65292;&#23558;&#37096;&#38376;&#21517;&#31216;&#21152;&#36827;&#26469;</span>
<span style="color: #a020f0;">select</span> s.deptno, d.dname, s.cnt
  <span style="color: #a020f0;">from</span> <span style="color: #707183;">(</span><span style="color: #a020f0;">select</span> deptno, <span style="color: #483d8b;">count</span><span style="color: #7388d6;">(</span>*<span style="color: #7388d6;">)</span> <span style="color: #a020f0;">as</span> cnt <span style="color: #a020f0;">from</span> emp  <span style="color: #a020f0;">group</span> <span style="color: #a020f0;">by</span> deptno<span style="color: #707183;">)</span> <span style="color: #a020f0;">as</span> s
  <span style="color: #a020f0;">join</span> dept <span style="color: #a020f0;">as</span> d <span style="color: #a020f0;">on</span> s.deptno = d.deptno;

<span style="color: #b22222;">-- &#31532;&#20108;&#31181;&#65292;&#20808;&#23558;&#25152;&#26377;&#35201;&#20998;&#32452;&#30340;&#25968;&#25454;&#25630;&#20986;&#26469;&#65292;&#20877;&#36827;&#34892;&#20854;&#20182;&#25805;&#20316;</span>
<span style="color: #a020f0;">select</span> d.dname, <span style="color: #483d8b;">COUNT</span><span style="color: #707183;">(</span>*<span style="color: #707183;">)</span> <span style="color: #a020f0;">from</span> emp <span style="color: #a020f0;">as</span> e
  <span style="color: #a020f0;">join</span> dept <span style="color: #a020f0;">as</span> d <span style="color: #a020f0;">on</span> e.deptno = d.deptno
  <span style="color: #a020f0;">group</span> <span style="color: #a020f0;">by</span> d.dname;
</pre>
</div>
</div>
</div>

<div id="outline-container-org94d8b64" class="outline-3">
<h3 id="org94d8b64"><span class="section-number-3">2.2.</span> 查询除去 salesman 所有平均工资超过 1500 的部门</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a020f0;">select</span> deptno, <span style="color: #483d8b;">AVG</span><span style="color: #707183;">(</span>sal<span style="color: #707183;">)</span> <span style="color: #a020f0;">from</span> emp
  <span style="color: #a020f0;">where</span> job &lt;&gt; <span style="color: #8b2252;">'salesman'</span>
  <span style="color: #a020f0;">group</span> <span style="color: #a020f0;">by</span> deptno
  <span style="color: #a020f0;">having</span> <span style="color: #483d8b;">AVG</span><span style="color: #707183;">(</span>sal<span style="color: #707183;">)</span> &gt; 1500;

<span style="color: #a020f0;">select</span> d.dname, <span style="color: #483d8b;">AVG</span><span style="color: #707183;">(</span>sal<span style="color: #707183;">)</span> <span style="color: #a020f0;">from</span> emp <span style="color: #a020f0;">as</span> e
  <span style="color: #a020f0;">join</span> dept <span style="color: #a020f0;">as</span> d <span style="color: #a020f0;">on</span> e.deptno = d.deptno
  <span style="color: #a020f0;">where</span> job &lt;&gt; <span style="color: #8b2252;">'salesman'</span>
  <span style="color: #a020f0;">group</span> <span style="color: #a020f0;">by</span> d.dname
  <span style="color: #a020f0;">having</span> <span style="color: #483d8b;">AVG</span><span style="color: #707183;">(</span>sal<span style="color: #707183;">)</span> &gt; 1500;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdade464" class="outline-3">
<h3 id="orgdade464"><span class="section-number-3">2.3.</span> 查询在 new york 工作的所有员工的姓名，部门名称和工资信息</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a020f0;">select</span> dname, ename, sal <span style="color: #a020f0;">from</span> emp
  <span style="color: #a020f0;">join</span> dept <span style="color: #a020f0;">on</span> emp.deptno = dept.deptno
  <span style="color: #a020f0;">where</span> loc =  <span style="color: #8b2252;">'new york'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb75295" class="outline-3">
<h3 id="orgbb75295"><span class="section-number-3">2.4.</span> 查询姓名为 King 的员工的编号，名称跟部门</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a020f0;">select</span> empno,ename,dept.dname <span style="color: #a020f0;">from</span> emp
  <span style="color: #a020f0;">join</span> dept <span style="color: #a020f0;">on</span> dept.deptno = emp.deptno
   <span style="color: #a020f0;">where</span> ename = <span style="color: #8b2252;">'King'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa89afa" class="outline-3">
<h3 id="orgaa89afa"><span class="section-number-3">2.5.</span> 查询各种工作的最低工资</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a020f0;">select</span> job,<span style="color: #483d8b;">min</span><span style="color: #707183;">(</span>sal<span style="color: #707183;">)</span> <span style="color: #a020f0;">as</span> small <span style="color: #a020f0;">from</span> emp <span style="color: #a020f0;">group</span> <span style="color: #a020f0;">by</span> job;
</pre>
</div>
</div>
</div>

<div id="outline-container-orga35c2ef" class="outline-3">
<h3 id="orga35c2ef"><span class="section-number-3">2.6.</span> 查询工龄大于 10 年的所有员工信息</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a020f0;">select</span> * <span style="color: #a020f0;">from</span> emp
  <span style="color: #a020f0;">where</span> datediff<span style="color: #707183;">(</span><span style="color: #a020f0;">YEAR</span>, hiredate, GETDATE<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span> &gt; 10
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b9a30b" class="outline-3">
<h3 id="org1b9a30b"><span class="section-number-3">2.7.</span> 查询每个部门员工数量，平均工资和平均工作年限</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a020f0;">select</span>
    dept.dname,
    <span style="color: #483d8b;">COUNT</span><span style="color: #707183;">(</span>*<span style="color: #707183;">)</span> <span style="color: #a020f0;">as</span> person,
    <span style="color: #483d8b;">AVG</span><span style="color: #707183;">(</span>sal<span style="color: #707183;">)</span> <span style="color: #a020f0;">as</span> a,
    <span style="color: #483d8b;">AVG</span><span style="color: #707183;">(</span>DATEDIFF<span style="color: #7388d6;">(</span><span style="color: #a020f0;">YEAR</span>, hiredate, GETDATE<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #a020f0;">as</span> worktime
  <span style="color: #a020f0;">from</span> emp <span style="color: #a020f0;">join</span> dept <span style="color: #a020f0;">on</span> emp.deptno = dept.deptno
  <span style="color: #a020f0;">group</span> <span style="color: #a020f0;">by</span> dept.dname;
</pre>
</div>
</div>
</div>

<div id="outline-container-org419833e" class="outline-3">
<h3 id="org419833e"><span class="section-number-3">2.8.</span> 统计各部门每个工种的人数，平均工资</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a020f0;">select</span> deptno,
       job,
       <span style="color: #483d8b;">count</span><span style="color: #707183;">(</span>empno<span style="color: #707183;">)</span> <span style="color: #a020f0;">as</span> allpeople,
       <span style="color: #483d8b;">avg</span><span style="color: #707183;">(</span>sal<span style="color: #707183;">)</span> <span style="color: #a020f0;">as</span> gongzi
   <span style="color: #a020f0;">from</span> emp
   <span style="color: #a020f0;">group</span> <span style="color: #a020f0;">by</span> job, deptno;
</pre>
</div>
</div>
</div>

<div id="outline-container-org5963880" class="outline-3">
<h3 id="org5963880"><span class="section-number-3">2.9.</span> 查询从事同一种工作但不属于同一部门的员工信息</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a020f0;">select</span> a.ename, a.empno, b.empno, b.ename
  <span style="color: #a020f0;">from</span> emp a
  <span style="color: #a020f0;">join</span> emp b <span style="color: #a020f0;">on</span> a.job=b.job
  <span style="color: #a020f0;">where</span> a.deptno &lt;&gt; b.deptno
    <span style="color: #a020f0;">and</span> a.empno &gt; b.empno;
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ename</th>
<th scope="col" class="org-right">empno</th>
<th scope="col" class="org-right">empno</th>
<th scope="col" class="org-left">ename</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SMITH</td>
<td class="org-right">7369</td>
<td class="org-right">&lt;   7900</td>
<td class="org-left">JAMES</td>
</tr>

<tr>
<td class="org-left">JAMES</td>
<td class="org-right">7900</td>
<td class="org-right">&gt;   7369</td>
<td class="org-left">SMITH</td>
</tr>

<tr>
<td class="org-left">MILLER</td>
<td class="org-right">7934</td>
<td class="org-right">7369</td>
<td class="org-left">SMITH</td>
</tr>

<tr>
<td class="org-left">BLAKE</td>
<td class="org-right">7698</td>
<td class="org-right">7566</td>
<td class="org-left">JONES</td>
</tr>

<tr>
<td class="org-left">CLARK</td>
<td class="org-right">7782</td>
<td class="org-right">7566</td>
<td class="org-left">JONES</td>
</tr>

<tr>
<td class="org-left">CLARK</td>
<td class="org-right">7782</td>
<td class="org-right">7698</td>
<td class="org-left">BLAKE</td>
</tr>

<tr>
<td class="org-left">JAMES</td>
<td class="org-right">7900</td>
<td class="org-right">7876</td>
<td class="org-left">ADAMS</td>
</tr>

<tr>
<td class="org-left">MILLER</td>
<td class="org-right">7934</td>
<td class="org-right">7876</td>
<td class="org-left">ADAMS</td>
</tr>

<tr>
<td class="org-left">MILLER</td>
<td class="org-right">7934</td>
<td class="org-right">7900</td>
<td class="org-left">JAMES</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org73295a2" class="outline-3">
<h3 id="org73295a2"><span class="section-number-3">2.10.</span> 查询所有员工工资都大于 1000 的部门的信息及员工信息</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #a020f0;">select</span> * <span style="color: #a020f0;">from</span> emp e
  <span style="color: #a020f0;">join</span> dept d <span style="color: #a020f0;">on</span> e.deptno = d.deptno
  <span style="color: #a020f0;">join</span> <span style="color: #707183;">(</span><span style="color: #a020f0;">select</span> deptno <span style="color: #a020f0;">from</span> emp
          <span style="color: #a020f0;">group</span> <span style="color: #a020f0;">by</span> deptno
          <span style="color: #a020f0;">having</span> <span style="color: #483d8b;">min</span><span style="color: #7388d6;">(</span>sal + ISNULL<span style="color: #909183;">(</span>comm,0<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> &gt; 1000<span style="color: #707183;">)</span> c <span style="color: #a020f0;">on</span> e.deptno = c.deptno;

<span style="color: #a020f0;">select</span> * <span style="color: #a020f0;">from</span> dept a  <span style="color: #a020f0;">join</span> emp b
  <span style="color: #a020f0;">on</span> a.deptno = b.deptno
  <span style="color: #a020f0;">where</span> a.deptno <span style="color: #a020f0;">not</span> <span style="color: #a020f0;">in</span><span style="color: #707183;">(</span><span style="color: #a020f0;">select</span> deptno <span style="color: #a020f0;">from</span> emp <span style="color: #a020f0;">where</span> sal &lt; 1000<span style="color: #707183;">)</span>;
</pre>
</div>
</div>
</div>
