.src/旧笔记(163)/SQLServer/f-misc.org
** 其他题目

- 查询入职日期早于其直接上级的所有员工信息。
- 列出雇员中（除去mgr为空的人)工资第二高的人。
- 列出1981年来公司所有员工的总收入（包括sal和comm）
- 查询部门编号为 10 和 30 的所有人（用不同方式查询）
- 查询部门编号为 10 和 30 中名字中不含有 ‘C’ 的所有人
- 查询部门编号为 10 和 30 中名字首字母之外不含有 ‘C’ 的所有人
- 查询部门编号为 10 和 30 中所有的经理以及名字首字母之外不含有 ‘C’ 的所有人
- 查询纽约和芝加哥地区所有的经理以及名字首字母之外不含有 ‘C’ 的所有人
- 查询纽约和芝加哥地区所有的经理以及顶头上司名字的首字母之外不含有 ‘C’ 的所有人
- 查询每个人的工资等级
- 查询每个部门的平均工资的等级
- 查询每个组最高工资的那些人

* Lagou.com 测试数据

[[file:asset/lagou.rar][下载 sql 文件]].

* 奇 vs 偶
** 1/3/5/7 出的题

- 查询在北京，本科及本科以上，在招前端开发工程师的公司
- 查询在天河区，招本科的所有岗位

- 查询深圳在招“3C产品开发/运营”，并且要求学历“大专”的公司及工作要求
- 查询深圳不需要融资的公司

- 查询学历为博士的数量
- 查询学历为本科，最大年薪大于 50 万，且降序排序 

- 查询广州人数在 100-150 的上市公司 
- 查询北京人数在 50 的科技公司

** 2/4/6/8 出的题

- 查询珠海所在的公司名字以及所需人员，工作经验和岗位以及学历
- 查找所有在广州招聘的岗位，并且学历都在 本科以上

- 查询在珠海职位为 Java 并且工资大于全国职位是 Java 平均工资的公司
- 查询北京地区工资前十的岗位，显示其公司、岗位、工资、要求

- 查询平均工资，在广州工作 1-3 年的 Java 工程师
- 查询广州，招系统架构师的公司

- 查询珠海工资最高的工作
- 查询广州'开发/测试/运维类 - 后端开发'的最高年薪和最低年薪和他们之间的差距

