html/0-163-notes/SQLServer/f-misc.html

<div id="outline-container-orgf601043" class="outline-3">
<h3 id="orgf601043"><span class="section-number-3">2.11.</span> 其他题目</h3>
<div class="outline-text-3" id="text-2-11">
<ul class="org-ul">
<li>查询入职日期早于其直接上级的所有员工信息。</li>
<li>列出雇员中（除去mgr为空的人)工资第二高的人。</li>
<li>列出1981年来公司所有员工的总收入（包括sal和comm）</li>
<li>查询部门编号为 10 和 30 的所有人（用不同方式查询）</li>
<li>查询部门编号为 10 和 30 中名字中不含有 ‘C’ 的所有人</li>
<li>查询部门编号为 10 和 30 中名字首字母之外不含有 ‘C’ 的所有人</li>
<li>查询部门编号为 10 和 30 中所有的经理以及名字首字母之外不含有 ‘C’ 的所有人</li>
<li>查询纽约和芝加哥地区所有的经理以及名字首字母之外不含有 ‘C’ 的所有人</li>
<li>查询纽约和芝加哥地区所有的经理以及顶头上司名字的首字母之外不含有 ‘C’ 的所有人</li>
<li>查询每个人的工资等级</li>
<li>查询每个部门的平均工资的等级</li>
<li>查询每个组最高工资的那些人</li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org9f63fb1" class="outline-2">
<h2 id="org9f63fb1"><span class="section-number-2">3.</span> Lagou.com 测试数据</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="asset/lagou.rar">下载 sql 文件</a>.
</p>
</div>
</section>

<section id="outline-container-orge53d53b" class="outline-2">
<h2 id="orge53d53b"><span class="section-number-2">4.</span> 奇 vs 偶</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgdea7b96" class="outline-3">
<h3 id="orgdea7b96"><span class="section-number-3">4.1.</span> 1/3/5/7 出的题</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>查询在北京，本科及本科以上，在招前端开发工程师的公司</li>
<li>查询在天河区，招本科的所有岗位</li>

<li>查询深圳在招“3C产品开发/运营”，并且要求学历“大专”的公司及工作要求</li>
<li>查询深圳不需要融资的公司</li>

<li>查询学历为博士的数量</li>
<li>查询学历为本科，最大年薪大于 50 万，且降序排序</li>

<li>查询广州人数在 100-150 的上市公司</li>
<li>查询北京人数在 50 的科技公司</li>
</ul>
</div>
</div>

<div id="outline-container-org762c587" class="outline-3">
<h3 id="org762c587"><span class="section-number-3">4.2.</span> 2/4/6/8 出的题</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>查询珠海所在的公司名字以及所需人员，工作经验和岗位以及学历</li>
<li>查找所有在广州招聘的岗位，并且学历都在 本科以上</li>

<li>查询在珠海职位为 Java 并且工资大于全国职位是 Java 平均工资的公司</li>
<li>查询北京地区工资前十的岗位，显示其公司、岗位、工资、要求</li>

<li>查询平均工资，在广州工作 1-3 年的 Java 工程师</li>
<li>查询广州，招系统架构师的公司</li>

<li>查询珠海工资最高的工作</li>
<li>查询广州'开发/测试/运维类 - 后端开发'的最高年薪和最低年薪和他们之间的差距</li>
</ul>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 悟饭</p>
<p class="date">Created: 2021-12-27</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
